package saa;

// Алгоритъмът работи с входен масив arr,
//като приема, че всички елементи са цели числа в обхвата [0,k], където k е максималната стойност в масива.

public class CountingSort {
    public static void countingSort(int[] arr, int k) {
        int n = arr.length;
        int[] count = new int[k + 1]; // Помощният масив C. 
        // Той има размер k+1 (от индекс 0 до k) и ще се използва за преброяване на честотата на всяко число.
        int[] output = new int[n]; // Изходният масив B. 
        //Той има същия размер като входния масив (n) и ще съдържа сортираните елементи.

        // 1. Преброяване
        for (int num : arr) {
            count[num]++;
        }
        // Този цикъл обхожда всеки елемент (num) във входния масив arr.
        //За всяко срещане на число i, се увеличава с 1 броячът на съответния индекс i в масива count.
        //Резултат: След този цикъл, count[i] съдържа общия брой на елементите, които имат стойност i.

        // 2. Натрупване
        for (int i = 1; i <= k; i++) {
            count[i] += count[i - 1];
        }
        // Този цикъл обхожда масива count, започвайки от индекс 1.
        //Настоящата стойност count[i] се сумира с предходната count[i - 1].
        //Резултат: След този цикъл, count[i] вече не съдържа броя на i-ките, 
        //а съдържа общия брой на елементите, които са по-малки или равни на i. 
        //Това число служи като индекс (позиция) в изходния масив B за последния елемент със стойност i.

        // 3. Подреждане (отзад напред)
        for (int i = n - 1; i >= 0; i--) {
            // // 1. Позициониране:
            // count[arr[i]] дава крайната позиция (индекс + 1).
            // Поставя arr[i] в output на индекса count[arr[i]] - 1.
            output[count[arr[i]] - 1] = arr[i];
            // 2. Намаляване на брояча:
            // Намалява позицията с 1, за да гарантира, че следващият дублиран елемент
            // ще отиде на предишното свободно място (поддържа стабилността).
            count[arr[i]]--;
        }

        // 4. Копиране обратно
        System.arraycopy(output, 0, arr, 0, n);
    }

    public static void main(String[] args) {
        int[] arr = {3, 0, 2, 3, 1, 0, 2, 1, 3, 2};
        int k = 3;

        countingSort(arr, k);

        System.out.print("Сортиран масив: ");
        for (int num : arr) {
            System.out.print(num + " ");
        }
    }
}


